# описание команд
inf_m = {'-м2': 'photo-196764812_457244021',
         '-м3': 'photo-196764812_457244022'}

# предел и непрерывность функций одной переменной
lim_con_fun_sing_var = [['-м2-1', 'критерий коши существования предела функции в точке', 'photo-196764812_457239046'],
                        ['-м2-2', 'теорема о непрерывности сложной фукнции', 'photo-196764812_457239047'],
                        ['-м2-3', 'теорема о локальной ограниченности '
                                  'непрерывной функции', 'photo-196764812_457239048'],
                        ['-м2-4', 'теорема об устойчивости знака функции, '
                                  'непрерывной в точке', 'photo-196764812_457239059'],
                        ['-м2-5', 'теорема о прохождении непрерывной функции '
                                  'через промежуточные значения', 'photo-196764812_457239050'],
                        ['-м2-6', 'первая теорема вейерштрасса', 'photo-196764812_457239051'],
                        ['-м2-7', 'вторая теорема вейерштрасса', 'photo-196764812_457239052'],
                        ['-м2-8', 'теорема о точках разрыва монотонной фукнции', 'photo-196764812_457239053'],
                        ['-м2-9', 'критерий непрерывности монотонной функции', 'photo-196764812_457239054'],
                        ['-м2-10', 'теорема об обратной функции', 'photo-196764812_457239055'],
                        ['-м2-11', 'первый замечательный предел', 'photo-196764812_457239056'],
                        ['-м2-12', 'второй замечательный предел', 'photo-196764812_457239057'],
                        ['-м2-13', 'теорема кантора', 'photo-196764812_457239058']]

# дифференцируемость функций одной переменной
dif_fun_sing_var = [['-м3-1', 'формула лейбница', 'photo-196764812_457239023'],
                    ['-м3-2', 'теорема ферма', 'photo-196764812_457239024'],
                    ['-м3-3', 'теорема ролля', 'photo-196764812_457239025'],
                    ['-м3-4', 'теорема лагранжа', 'photo-196764812_457239026'],
                    ['-м3-5', 'теорема коши', 'photo-196764812_457239027'],
                    ['-м3-6', 'первое правило лопиталя', 'photo-196764812_457239028'],
                    ['-м3-7', 'второе правило лопиталя', 'photo-196764812_457239029'],
                    ['-м3-8', 'формула тейлора', 'photo-196764812_457239030'],
                    ['-м3-9', 'формула тейлора c остаточным членом в форме Лагранжа', 'photo-196764812_457239031'],
                    ['-м3-10', 'формула тейлора с остаточным членом в форме Коши', 'photo-196764812_457239032'],
                    ['-м3-11', 'формула тейлора с остаточным членом в форме Пеано', 'photo-196764812_457239033'],
                    ['-м3-12', 'формула маклорена', 'photo-196764812_457239035'],
                    ['-м3-13', 'теорема дарбу', 'photo-196764812_457239036'],
                    ['-м3-14', 'первое достаточное условие экстремума', 'photo-196764812_457239037'],
                    ['-м3-15', 'второе достаточное условие экстремума', 'photo-196764812_457239038'],
                    ['-м3-16', 'третье достаточное условие экстремума', 'photo-196764812_457239039'],
                    ['-м3-17', 'неравенство йенсена', 'photo-196764812_457239040'],
                    ['-м3-18', 'необходимое условие перегиба', 'photo-196764812_457239041'],
                    ['-м3-19', 'первое достаточное условие перегиба', 'photo-196764812_457239042'],
                    ['-м3-20', 'второе достаточное условие перегиба', 'photo-196764812_457239043'],
                    ['-м3-21', 'третье достаточное условие перегиба', 'photo-196764812_457239045']]
